ttrftech/LPC4370SDR-FM/src/main.c
struct {
	uint32_t last;
} fm_demod_state;

void fm_demod()
{
	uint32_t *src = (uint32_t *)DEMOD_BUFFER;
	int16_t *dest = (int16_t *)RESAMPLE_BUFFER;
	int32_t length = DEMOD_BUFFER_SIZE / sizeof(uint32_t);
	int i;

	uint32_t x0 = fm_demod_state.last;
	for (i = 0; i < length; i++) {
		uint32_t x1 = src[i];
		int32_t d = __SMUSDX(__SSUB16(x1, x0), x1);
		int32_t n = __SMUAD(x1, x1) >> 10;
		int32_t y = d / n;
		dest[i] = y;
		//dest[i] = __SSAT((y * ((1<<16) + ((y * y) >> 4) / 3)) >> 16, 16);
		x0 = x1;
	}
	fm_demod_state.last = x0;
}

#define RESAMPLE_NUM_TAPS	128

q15_t resample_fir_coeff_even[RESAMPLE_NUM_TAPS] = {
		   3,    0,   -3,   -6,   -7,   -5,   -1,    4,    9,   11,    9,
		          3,   -5,  -14,  -19,  -17,   -8,    5,   21,   31,   30,   18,
		         -4,  -28,  -46,  -49,  -33,   -1,   36,   66,   76,   57,   13,
		        -42,  -91, -111,  -93,  -35,   44,  119,  160,  145,   72,  -39,
		       -154, -228, -226, -136,   22,  200,  334,  363,  255,   23, -274,
		       -539, -662, -550, -163,  475, 1270, 2076, 2732, 3100, 3100, 2732,
		       2076, 1270,  475, -163, -550, -662, -539, -274,   23,  255,  363,
		        334,  200,   22, -136, -226, -228, -154,  -39,   72,  145,  160,
		        119,   44,  -35,  -93, -111,  -91,  -42,   13,   57,   76,   66,
		         36,   -1,  -33,  -49,  -46,  -28,   -4,   18,   30,   31,   21,
		          5,   -8,  -17,  -19,  -14,   -5,    3,    9,   11,    9,    4,
		         -1,   -5,   -7,   -6,   -3,    0,    3};
q15_t resample_fir_coeff_odd[RESAMPLE_NUM_TAPS] = {
		   1,   -2,   -5,   -7,   -6,   -3,    1,    7,   11,   11,    7,
		          0,  -10,  -17,  -19,  -14,   -1,   13,   27,   32,   25,    7,
		        -16,  -39,  -50,  -44,  -19,   17,   53,   74,   70,   38,  -14,
		        -69, -105, -107,  -68,    3,   84,  146,  160,  115,   19,  -99,
		       -199, -238, -191,  -63,  112,  276,  364,  327,  152, -122, -417,
		       -625, -639, -391,  129,  861, 1682, 2433, 2959, 3148, 2959, 2433,
		       1682,  861,  129, -391, -639, -625, -417, -122,  152,  327,  364,
		        276,  112,  -63, -191, -238, -199,  -99,   19,  115,  160,  146,
		         84,    3,  -68, -107, -105,  -69,  -14,   38,   70,   74,   53,
		         17,  -19,  -44,  -50,  -39,  -16,    7,   25,   32,   27,   13,
		         -1,  -14,  -19,  -17,  -10,    0,    7,   11,   11,    7,    1,
		         -3,   -6,   -7,   -5,   -2,    1,    0};

// 312.5kHz * 2/13 -> 48.076923kHz

struct {
	int32_t index;
	float deemphasis_mult;
	float deemphasis_rest;
	float deemphasis_value;
} resample_state;

struct {
	int write_current;
	int write_total;
	int read_total;
	int read_current;
	int rebuffer_count;
} audio_state;

void
deemphasis_init(int timeconst_us)
{
	resample_state.deemphasis_value = 0;
	resample_state.deemphasis_mult = exp(-1e6/(timeconst_us * AUDIO_RATE));
	resample_state.deemphasis_rest = 1 - resample_state.deemphasis_mult;
}

#define INDEX_STEP (int32_t)((312500 * 65536 * 2) / 48000)

void resample_fir_filter()
{
	const uint32_t *coeff;
	const uint16_t *src = (const uint16_t *)RESAMPLE_STATE;
	const uint32_t *s;
	int32_t tail = RESAMPLE_BUFFER_SIZE;
	int32_t idx = resample_state.index;
	int32_t acc;
	int i, j;
	int cur = audio_state.write_current;
	uint16_t *dest = (uint16_t *)AUDIO_BUFFER;
	float value = resample_state.deemphasis_value;

	while (idx < tail) {
		//i = idx >> 16;
		if (idx & 0x1)
			coeff = (uint32_t*)resample_fir_coeff_odd;
		else
			coeff = (uint32_t*)resample_fir_coeff_even;

		acc = 0;
		s = (const uint32_t*)&src[idx >> 1];
		for (j = 0; j < RESAMPLE_NUM_TAPS / 2; j++) {
			acc = __SMLAD(*s++, *coeff++, acc);
		}

		// deemphasis with time constant
		value = (float)acc * resample_state.deemphasis_rest + value * resample_state.deemphasis_mult;
		dest[cur++] = __SSAT(((int32_t)value >> 10), 16);
		cur %= AUDIO_BUFFER_SIZE / 2;
		audio_state.write_total++;
		//dest[cur++] = __PKHBT(__SSAT((acc0 >> 15), 16), __SSAT((acc1 >> 15), 16), 16);
		idx += 13;
		//idx += INDEX_STEP;
	}

	resample_state.deemphasis_value = value;
	audio_state.write_current = cur;
	resample_state.index = idx - tail;
	uint32_t *state = (uint32_t *)RESAMPLE_STATE;
	src = &src[tail / sizeof(*src)];
	for (i = 0; i < RESAMPLE_STATE_SIZE / sizeof(uint32_t); i++) {
		//*state++ = *src++;
	    __asm__ volatile ("ldr r0, [%0], #+4\n" : : "r" (src) : "r0");
	    __asm__ volatile ("str r0, [%0], #+4\n" : : "r" (state));
	}
}


#define REBUFFER_THRESHOLD 	(7 * (AUDIO_BUFFER_SIZE/2) / 8)
#define REBUFFER_WR_GAP 	(1 * (AUDIO_BUFFER_SIZE/2) / 8)

void
audio_rebuffer()
{
	int d = audio_state.write_current - audio_state.read_current;
	d %= AUDIO_BUFFER_SIZE / 2;
	if (d > REBUFFER_THRESHOLD) {
		audio_state.read_current = (audio_state.write_current - REBUFFER_WR_GAP) % (AUDIO_BUFFER_SIZE / 2);
		audio_state.rebuffer_count++;
	}
}

void DMA_IRQHandler (void)
{
  if (LPC_GPDMA->INTERRSTAT & 1)
  {
    LPC_GPDMA->INTERRCLR = 1;
  }

  if (LPC_GPDMA->INTTCSTAT & 1)
  {
	LPC_GPDMA->INTTCCLEAR = 1;
	//LPC_GPDMA->C0CONFIG |= (1 << 18); //halt further requests

	//TOGGLE_MEAS_PIN_3();
    const int length = CAPTUREBUFFER_SIZE / 2;
	SET_MEAS_PIN_3();
    if ((capture_count & 1) == 0) {
    	cic_decimate_i(&cic_i, CAPTUREBUFFER, length);
    	cic_decimate_q(&cic_q, CAPTUREBUFFER, length);
    } else {
    	cic_decimate_i(&cic_i, CAPTUREBUFFER + length, length);
    	cic_decimate_q(&cic_q, CAPTUREBUFFER + length, length);
    }
	fir_filter_iq();
	fm_demod();
	resample_fir_filter();
	audio_rebuffer();
    CLR_MEAS_PIN_3();
    capture_count ++;
  }
}

static void VADC_SetupDMA(void)
{
  int i;
  uint32_t transSize;

  NVIC_DisableIRQ(DMA_IRQn);
  LPC_GPDMA->C0CONFIG = 0;

  /* clear all interrupts on channel 0 */
  LPC_GPDMA->INTTCCLEAR = 0x01;
  LPC_GPDMA->INTERRCLR = 0x01;

  /* Setup the DMAMUX */
  LPC_CREG->DMAMUX &= ~(0x3<<(VADC_DMA_WRITE*2));
  LPC_CREG->DMAMUX |= 0x3<<(VADC_DMA_WRITE*2);  /* peripheral 7 vADC Write(0x3) */
  LPC_CREG->DMAMUX &= ~(0x3<<(VADC_DMA_READ*2));
  LPC_CREG->DMAMUX |= 0x3<<(VADC_DMA_READ*2);  /* peripheral 8 vADC read(0x3) */

